// Напишите программу, которая на вход принимает два числа и проверяет, является ли
//первое число квадратом второго.

Console.Clear();
int a = 4;
int b = 25;
int D = a*a;
if (D == b)
Console.WriteLine("Yes");
else
Console.WriteLine("No");